Public Class Form_license
    Private Sub 用户协议_Load(sender As Object, e As EventArgs) Handles MyBase.Load
        txt.Text = "　　　　　　                                                 最终用户软件许可协议
    在使用小说下载阅读器（以下简称阅读器）前，请您务必仔细阅读并透彻理解本声明。您可以选择不使用阅读器，但如果您使用阅读器，您的使用行为将被视为对本声明全部内容的认可。
    鉴于阅读器以非人工检索方式、根据您键入的关键字自动生成到第三方网页的搜索链接，一切因使用阅读器而可能遭致的意外、疏忽、侵权及其造成的损失，阅读器对其概不负责，亦不承担任何法律责任。
    任何通过使用阅读器而搜索链接到的第三方网页均系他人制作或提供，您可能从该第三方网页上获得资讯及享用服务，阅读器对其合法性概不负责，亦不承担任何法律责任。
    阅读器搜索结果根据您键入的关键字自动搜索获得并生成，不代表阅读器赞成被搜索链接到的第三方网页上的内容或立场。
    您应该对使用阅读器搜索的结果自行承担风险。阅读器不做任何形式的保证：不保证搜索结果满足您的要求，不保证搜索服务不中断，不保证搜索结果的安全性、正确性、及时性、合法性。
    任何网站如果不想被阅读器收录（即不被搜索到），应该及时向书之城反映，否则，阅读器将依照惯例视其为可收录的搜索网站。
    任何单位或个人认为通过阅读器搜索链接到的第三方网页内容可能涉嫌侵犯其信息网络传播权，应该及时向书之城提出书面权利通知，并提供身份证明、权属证明及详细侵权情况证明。书之城在收到上述法律文件后，将会依法尽快在新的版本中断开相应内容。
    使用阅读器下载的小说及漫画等版权归原作者所有，仅为个人学习、研究或欣赏，请勿用于商业传播。请在法律允许范围内下载，所有因下载引起的纠纷，与本软件无关。
本系统的版权和所有权：
　　本系统及文档享有版权，并受国家版权法及国际协约条款的保护。您不可以从本软件中去掉其版权声明；并保证为本系统的拷贝（全部或部分）复制版权声明。您同意制止以任何形式非法拷贝本系统及文档。
责任有限：
　　无论遵循本协议与否，就使用本系统而产生的任何形式的间接、特别、意外或必然的损失，或任何其他方的索赔，本公司及其代理、销售人概不负责。
适用法律：
　　《知识产权保护条例》、《版权、著作权法》、《专利法》等。
　　至此，您肯定已经详细阅读并已理解本协议，并同意严格遵守各条款和条件"
    End Sub
End Class